Handling Missing Values

In [1]:
import pandas as pd

In [2]:
#updating the dataset with null values

df = pd.DataFrame({
    "Name": ["Aman", "Saurav", "Karan", "shubham", None, "sameer"],
    "Age": [22, 23, None, 22, 25, 26],
    "Marks": [85, None, 88, 90, 56, None]
})

df

      Name   Age  Marks
0     Aman  22.0   85.0
1   Saurav  23.0    NaN
2    Karan   NaN   88.0
3  shubham  22.0   90.0
4     None  25.0   56.0
5   sameer  26.0    NaN

In [3]:
df.isnull().sum()

Name     1
Age      1
Marks    2
dtype: int64